app/controllers/pages_controller.rb

  def blog
    @post = Post.all
---
SELECT "posts".* FROM "posts"