app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Second Title of Post"], ["body", "Body of second post"], ["slug", "second-title-of-post"], ["created_at", "2016-05-06 20:38:04.819276"], ["updated_at", "2016-05-06 20:38:04.819276"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_post
    @post = Post.friendly.find(params[:id])